#Написать цикл для выведения на экран каждой буквы своего ФИО.
FIO = input()
for l in FIO:
    if l != ' ':
        print(l)